[
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Yun",
      "num_reviews": "547 reviews",
      "num_followers": "27.2k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "5",
      "review_text": "I dreamed of who I used to be.Of who, or what, I might become.\nThis right here. This is what I've been waiting for. With Upgrade, Blake Crouch has finally written a successor worthy of Dark Matter.You might think that I have some sort of rigorous, scientific method for determining what makes a 5-star read for me. But honestly, it's just a feeling. I get this tingle that goes from the back of my head all the way down my spine. And when I feel it, I know that I've found something special and worth savoring. And that's what happened here.When I think of a great science fiction story, I think of something bold and imaginative, capable of surprising me and challenging my preconceived notions, one that reaches to the root of what it means to be human, and takes us on a journey of where we've been and where we're going. And this story is all that and more.Just like most Blake Crouch novels, this book feels accessible, even to those readers who don't normally indulge in the genre. And a large reason is because it reads like a thriller. It's relentlessly paced and utterly riveting, and I can't imagine trying to put it down once I've started. Every chapter held surprises and revelations, and even when I thought I was getting an inkling of where it might be headed, it still managed to prove me wrong.While the science in here is interesting, I suspect most readers will connect with it for far more reasons than that. It seamlessly blends a whole bunch of interesting and timely topics, from philosophy to ethics, evolution to the environment, that elevates it from just a story that passes through one's mind to a story that's truly arresting and memorable.I've noticed that Crouch is particularly adept at putting the reader in the shoes of the main character. We feel his pain, understand his choices, and appreciate the difficulty of his dilemmas. And it makes me wonder, what would I do when given such impossible choices? Would I have what it takes to sacrifice everything to do what needs to be done? I'd like to think so, and it's definitely an interesting thought to contemplate.A word of caution here. I normally include a small tease of the story I'm reviewing, but you'll notice I haven't included any such information here. It's because even that little bit feels like a spoiler. In fact, I've been careful not to allude to anything that happens in the entire story, and that's on purpose.I went into this completely blind and absolutely loved the initial pages as it set up the premise and got into the heart of the story. There were so many things that surprised me and those reveals contributed so much to the delightful experience of reading this book. After I finished, I read the blurb on the back, and it pretty much gives it all away. So my suggestion is to skip the blurb altogether and just go right into it. You'll be glad you did.Ever since Blake Crouch came out with Dark Matter, I've been waiting patiently for another book of his that will grab me just as much. (Recursion wasn't it, unfortunately.) I wanted another that would work on so many levels: a riveting and unputdownable thriller on the surface, but also thought-provoking and scientifically intriguing, and relatable to every reader even though the premise is so outrageous. And it seems my patience has finally paid off. ~~~~~~~~~~~~See also, my thoughts on:Dark MatterRecursion~~~~~~~~~~~~✧ Connect with me ✧ Instagram ✧",
      "num_likes": "956",
      "num_comments": "13"
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Nilufer Ozmekik",
      "num_reviews": "2,532 reviews",
      "num_followers": "51.5k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "5",
      "review_text": "Happy book birthday to this brilliant reading! I found my best sci-fi work of the year! I even loved it more than Dark Matter and Recursion! I’m warning you my friends: before starting this book you need a real upgrade as a reader. Giving your entire concentration and attention to fully enjoy any Blake Crouch books is a true talent you have to sharpen! Sometimes I wonder how a normal human being can create those mind blowing, grey cell exploding, eyes popping, jaw dropping plots! But interesting fact about Crouch’s books, he also gives us the most heartbreaking couple stories. Yes this ultra genius guy who can use words like enigmas you barely solve till the smoke comes out of your ears, is also an undeniable romantic. ( the ending of the book was great proof! Instead of my smoking ears, I have red eyes right now) His new book didn’t disappoint me! I definitely need brain transplant sooner ( don’t worry my old one was a little useless! Each time I read the chapters of the book, I asked myself “what, ha!, whatttt” and slapped my head! ) I think entire readers need their own upgrade version for fully appreciating everything written here! Let’s take a quick look to nail biter, heart throb get, mind spinning plot: Logan Ramsey, son of genius scientist Miriam Ramsey who massacred millions with her miscalculated experiment, working for GPA: a special organization fighting against gene editing.  When he questions Henrik Soren who is presumed to make a recent transportation of mining bacteria, he has no idea the delivery address Soren gives them will change his life forever. Explosives blast off at the basement he’s addressed and shrapnels puncture Logan’s hazmat suit and then… Bamm! He faints and opens his eyes at the quarantine. Doctors tell him he’s infected by a virus not to make him sick but to modify his very genetic structure! Logan works against the people who specialized gene editing tool knows Scythe and now he’s the victim of that people who try to change entire genetic structure of human beings.Luckily after running a fever, fearful nightmares later he finds out the virus is gone! He didn’t change! He’s still same 118 IQ’ed man, playing chess and getting defeated by 14 years old daughter, happily married man.But one month later, his bone density level gets higher and he suffers from body aches. Then he stars changing immediately! He has better concentration, night vision, photographic memory, needing less sleep, having increased muscle mass ( he can do one hand pushups and run faster than his twenty years old self) and higher pain tolerance. He turns into a super human and he’s not the only one suffering from this kind of transformation. And unfortunately if he wants to learn what’s truly happening to him, he has to face with his dark family past but that also means he’ll find himself in the middle of genetic war as a possible casualty!I’m stopping right now! My head truly hurts! As like his other books that story gave me book hungover! But trust me without too much headache you have no gain to enjoy this ultra smart and thrilling ride! As a devoted fan of the author, I wish I can give this book more than five stars to express how much I loved it!Special thanks to NetGalley and Random House Publishing Group/ Ballantine for sharing this amazing digital reviewer copy with me in exchange my honest thoughts.bloginstagramfacebooktwitter",
      "num_likes": "618",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Emily May",
      "num_reviews": "2,057 reviews",
      "num_followers": "311k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "Whoever did this to me was overwriting nature’s programming and taking control of evolution itself. That was a precarious game.\nI'm quite the Black Crouch fan at this point. His sci-fi thrillers always seem to draw me in instantly and drag me along for the wacky ride. Upgrade succeeds precisely because it is more of what the author does best.Basically, Crouch takes a sci-fi concept-- be it alternate universes, memory preservation, artificial intelligence or, as the case is here, genetic modification-- and adds a ton of fast-paced thrills like running from the government, dramatic twists, betrayals and \"oh, you thought that was bad, try this on for size.\" In addition, his sci-fi thrillers (I'm speaking specifically about this work since 2016) have a very human, often romantic component. His protagonists love their families deeply, fall in love so entirely, adore their children, and feel a sense of compassion towards humanity as a whole. It makes his stories emotionally engaging as well as thrilling, which is what I personally need as a reader.\nWhoever did this to me was overwriting nature’s programming and taking control of evolution itself. That was a precarious game.\nSet in the near future, this one sees Logan Ramsay experiencing some... changes, after a raid ends in an explosion. He can retain information better, solve complex problems, move a little faster, all on less sleep than before. It looks like somebody, for some reason, has used him as a guinea pig for genetic modification. And what's scarier is that it looks like this might just be the tip of the iceberg, the first stage of a much greater plan.I find it quite amusing that Crouch convinced me to read almost to the end of this novel without my realising that what I was reading was essentially a superhero story. It was so well told, Logan such a compelling character, that I didn't even pick up on it. I guess the best authors are those that can retell an old concept and make you believe you've never read anything quite like it before.",
      "num_likes": "660",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Emily (Books with Emily Fox on Youtube)",
      "num_reviews": "578 reviews",
      "num_followers": "64.8k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "3",
      "review_text": "This was underwhelming.I enjoyed the topic but this book didn't have the elements I usually like from the author (twists and unique concepts). It somehow felt a bit dated a la Jason Bourne (I have a personal vendetta against Matt Damon) so I quickly lost interest.I only finished because I've enjoyed his past work. Don't really recommend but we both you'll try it anyway!",
      "num_likes": "539",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Lisa of Troy",
      "num_reviews": "569 reviews",
      "num_followers": "5,681",
      "num_books": null
    },
    "review_info": {
      "star_rating": "5",
      "review_text": "Blake Crouch’s newest fantasy novel, Upgrade, will be unleashed on the public on July 12, 2022. Sorry I couldn’t help myself.Logan Ramsay is feeling great! He is able to concentrate better, multitask, read faster, and sleep less. However, Logan’s enhanced well-being isn’t due to diet and exercise. His genome has been hacked!Here’s the catch: This hack isn’t random. Logan has been targeted for a reason relating to his past and family history. Will Logan be able to stop history from repeating itself? Can he and should he stop the hack from spreading?ALDH4A1. Just one little gene that I have mutated. But those 7 characters mean everything to me. Because it causes a rare genetic defect (Fun Fact: I am part of the Mayo Clinic Rare Disease Database).In the past, doctors have generally treated the symptoms of a genetic illness. For example, if you have Wilson’s Disease where you can’t process copper, the doctors will remove the copper from your bloodstream and put you on a low copper diet. However, there is a new technology coming out called CRISPR. Big thanks to the Bill and Melinda Gates Foundation! It works by cutting out the mutated or “bad” DNA and replaces it with “good” DNA. Upgrade has such a great discussion of the good uses of DNA and some of the potential pitfalls. Currently, cloning is outlawed, but if CRISPR goes forward, and we can tweak some of our DNA, how far is too far? Could you program your DNA so that you could have the creativity of Walt Disney? The mind of Leonardo DaVinci? Play pro basketball? Have higher cheekbones? Where is the line? And who gets to draw the line? And who enforces the line? All very interesting questions.Upgrade is my very first Blake Crouch work, but I hope it isn’t the last. The book is incredibly interesting, and it has short sentences and paragraphs which keep the action flowing. It kept me guessing until the end.In addition to the little problem of the fate of humanity, there is some first-rate family drama! This book really reminded me of Girl One by Sara Flannery Murphy so if you enjoyed Upgrade I highly recommend giving that a go.*Thanks, NetGalley, for a free copy of this book in exchange for my fair and honest opinion.2024 Reading ScheduleJan\tMiddlemarchFeb\tThe Grapes of WrathMar\tOliver TwistApr\tMadame BovaryMay\tA Clockwork OrangeJun\tPossessionJul\tThe Folk of the Faraway Tree CollectionAug\tCrime and PunishmentSep\tHeart of DarknessOct\tMoby-DickNov\tFar From the Madding CrowdDec\tA Tale of Two CitiesConnect With Me!Blog Twitter BookTube Facebook Insta",
      "num_likes": "485",
      "num_comments": "3"
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Taylor Reid",
      "num_books": "21",
      "num_followers": "181k",
      "num_reviews": null
    },
    "review_info": {
      "star_rating": null,
      "review_text": "When Logan starts noticing changes in himself, he’s not sure if anything is different, but soon the changes are too stark to ignore. His genetic makeup has been upgraded. But the consequences of such upgrades have been broached in the past, and Logan will do everything he can to keep history from repeating itself. This one will keep you thinking long after you’ve set it down.",
      "num_likes": "408",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Regina",
      "num_reviews": "1,139 reviews",
      "num_followers": "4,021",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "If you got all tingly at the mere sight of this book, what you really want to know is if it’s an upgrade or downgrade from Dark Matter and Recursion, right? Here’s my quick take:Dark Matter ⭑⭑⭑⭑⭑Upgrade ⭑⭑⭑⭑Recursion ⭑⭑⭑I’ll get back to you tingly people in a moment, but for anyone completely lost right now (Hi Mom!) I’ll take a moment to explain that Blake Crouch is an extremely popular author of modern sci-fi novels that are accessible to mainstream readers that only dabble occasionally in the genre (Hi Self!). He really does lean hard on the “science” part of sci-fi though, so your brain can get quite a workout reading them. 2016’s Dark Matter was such a page-turning thrill ride, and it made me feel super smart! Then 2019’s Recursion came along, which to me felt repetitive in parts and over my head in others. 2022’s Upgrade started like a thrill, lagged a little, but then won me over in the end. The science of focus in Upgrade is genetic engineering. In the near future, the government has had to establish an ATF-like agency to regulate and crack down on civilian manipulation of DNA. I mean, you can’t have people just willy-nilly making weird unnatural shit in labs! Our book’s hero, Logan, is a member of that agency, and during a raid he gets blasted with DNA-modifying particles that make his intelligence - you guessed it - upgraded.There’s no denying that there’s a bit of a “save the earth” agenda to the story, so if you don’t agree at least on some level that human kind is on an unfavorable trajectory then this book is most definitely not for you. It’s also not for you if you don’t like a little adrenaline in your thrillers, because this is some action-packed drama. No surprise, adaptation rights have already been snapped up by Amblin Entertainment.What is surprising is the epilogue. Nine times out of ten epilogues are completely unnecessary turds, but this one was so thoughtful, heartfelt, and unexpected that it nudged my rating up a full star. Now that’s a worthwhile upgrade. My thanks to the author and Ballantine Books for the gifted review via NetGalley. Now available. Blog: https://www.confettibookshelf.com/",
      "num_likes": "387",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "MarilynW",
      "num_reviews": "1,381 reviews",
      "num_followers": "3,499",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "Upgrade by Blake CrouchMeet some mad scientists from the future. Since they think they are right and you are disposable, as collateral damage of their experiments, maybe you won't meet them or you will meet them in the most unfortunate of ways. There is no end to what they will do to achieve what they want, just try to stop them and you will die. Or course, you may die anyway. Logan Ramsey works for the GPA - Gene Protection Agency. He wanted to be a brilliant scientist but when put beside his mom's brilliance, he knew he couldn't make the cut. But he did work for her, with devastating results. Now he tries to apprehend anyone who might be involved in gene editing. But on his last job, there is an explosion, Logan is injured, and then Logan notices his body and mind changing. Everything about him is improving at a mind boggling rate. Now his own agency wants to study him and use him in their war against those who would tamper with genes. While Logan is gaining so much when it comes to his body and mind, he loses everything else that is important. But there is no time to mourn losses, he's the only one who can stop widespread destruction for the gains that rogue scientists want for humanity, even if what makes one human is wiped with their artificial means of evolution. Even though I don't understand most of the science, this story is easy to understand on other levels. It's both a thinking man's story and an action thriller and hits too close to home with some of the subjects it broaches. Once again, Crouch has written a story that will have me pondering it for a long time to come. Pub: July 12th 2022 Thank you to Random House Publishing Group - Ballantine and NetGalley for this ARC.",
      "num_likes": "319",
      "num_comments": "3"
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Snjez",
      "num_reviews": "842 reviews",
      "num_followers": "726",
      "num_books": null
    },
    "review_info": {
      "star_rating": "2",
      "review_text": "I appreciate the idea and the level of research behind this story, but sadly it failed to grab me like the other two books I've read by this author, Dark Matter and Recursion. The beginning was really strong and seemed promising, but at some point the story took a direction I didn't anticipate and, what's more important, wasn't comfortable with. The rest of the storyline didn't work so well for me, nor the resolution at the end. The middle part was slow and at times it seemed like nothing was happening. The story is very science-heavy, but more in a way that felt info-dumpy to me. It didn't help that I found Logan hard to connect with and, as the story progressed, quite unlikable. The audiobook is really good, though.",
      "num_likes": "308",
      "num_comments": "2"
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Dr. Appu Sasidharan (Dasfill)",
      "num_reviews": "1,358 reviews",
      "num_followers": "3,263",
      "num_books": null
    },
    "review_info": {
      "star_rating": "5",
      "review_text": "\"Intimate in scale yet epic in scope.\" It is these words in the blurb that gathered my attention. This is an intimate family story involving a mother and her children that will ultimately become a global one. I have always wondered how some authors or directors are able to portray an intimate story involving two or three individuals in a global sci-fi novel. Christopher Nolan showed us how to make an epic movie out of a father's promise to his daughter. Blake Crouch creates similar magic through this novel.The story revolves around Logan Ramsay, who is working in GPA (Gene Protection Agency) and is ready to destroy all the dark gene labs. One of the raids he conducted goes wrong, causing Logan to be exposed to an unknown virus that initially seems harmless but later starts upgrading his genome. Was it a planned attack or just a random raid gone wrong? Has Logan's family history got any connection to this upgrade? What will happen to him after the upgrade? What are the positives and negatives that Logan will have to face due to this upgrade? Is Logan the lonely person upgraded, or is he the first to get upgraded? Multiple questions like these crop up in the readers' minds when we read this novel. The author carefully considers all these questions and answers each one in the most convincing manner.This book is packed with a lot of Scientific information like all the other books written by the author (I recommend you to read the Dark Matter and Recursion, the two other novels written by the author which are also discussing some mind-bending concepts). Genetics is one of my favorite topics, and I am glad to see the meticulous research the author did in writing this book.\nWhat I learned from this book \n\n1) Can the books we read hold our genetic information? \nThis will be an interesting fact to read, especially for bibliophiles who love reading physical books. The author is saying how our genetic information can be trapped in each page we read and how it can be viewed by putting each page under a black light lamp. \"Vast amounts of DNA, or plasmids, could be hidden on the pages of a normal book—dropped in microliter increments and left to dry on the pages, only to be rehydrated and used elsewhere. Even a short novel like The Stranger could hold a near-infinite amount of genetic information, with each page hiding the genome sequence for a different mammal, a terrifying disease, or a synthetic species, any of which could be activated in a well-equipped dark gene lab.\"  \n2) What are the techniques used in gene editing, and what are the dangers associated with it? \n\n\nWe can indubitably say this is the most important topic discussed in this novel. Gene editing is the process that enables Scientists to change an organism's DNA. We can see a new (fictional) DNA modifier system called Scythe, discovered by Logan's mother. Blake Crouch tells how it is better than the current (real world) techniques used for the same. He also mentions the dangers of genome editing if not used judiciously in this novel. He is predicting one of the major dilemmas we will face in the near future if we progress at this pace without giving much importance to the ethics. \"Scythe was the revolutionary, biological DNA modifier system—now extremely illegal—discovered and patented by my mother, Miriam Ramsay. It had been a seismic leap forward that left the previous generations of technologies—ZFNs, TALENs, CRISPR-Cas9—gasping in the dust. Scythe had ushered in a new era of gene editing and delivery, one that brought about catastrophic results, which was why getting caught using or selling it for germline modification—the making of a new organism—came with a mandatory thirty-year prison sentence.\"  \n3) Will artificial intelligence pose the biggest threat to humankind in the future? \nArtificial intelligence is helping us a lot in our daily life. We should be grateful to those working on developing it as it makes us deal with our everyday life more easily. But what will be the case of it in the future? Will it pose a serious threat to our existence? The author is trying to discuss this topic elaborately in this novel. \"We lived in a veritable surveillance state, engaged with screens more than with our loved ones, and the algorithms knew us better than we knew ourselves. Every passing year, more jobs were lost to automation and artificial intelligence. \n 4) Which will be the toughest job for a human being in the future? \nAccording to Blake Crouch, being a Genetic Engineer will be the toughest job a human can do in the future. If we don't value the ethical aspects of scientific experiments, there is a high probability that the author's prediction can happen in the future. We can see a Nobel prize shortlisted Genetic engineer getting arrested due to the panic created by the scrupulous activities of some unethical rogue geneticists in this book. We can see a person trying to clone an improved version of his dead wife or parents who attempted to edit their son's muscular dystrophy to cure his disease, sadly making him a psychotic person who killed them before committing suicide. We can also see extreme versions of terrorism where weaponized life-forms of destruction by synthesizing ultra-smallpox relatives. \"The ones that hurt were the raids on real scientists. Those who'd been doing groundbreaking work, for all humankind, when governments panicked and made it practically impossible to be a genetic engineer.\"  \n5) Will pain dilate time perception? \nWhen we are watching a boring movie or reading a poorly written book, we might feel that the time seems to be running very slowly. Similarly, we will feel the same when we have severe pain due to a medical condition. A few studies have shown the relation between time and pain. It is one of those difficult studies where it is tough to come to a conclusion. We can see the author trying to tell us the relation between pain and time in this novel. “Pain distorts time, so I had no idea how much of it had passed when I finally heard the thunder of footsteps descending the stairs into the basement.”  \n6) What is interferon gamma? \nWe can see the Logan describing about interferon gamma in this book. Interferons are glycoproteins normally synthesised by virus-infected cells, exhibiting a wide range of antiviral and antitumoral properties. They are classified mainly into three\nInterferon alpha \n - used to treat Chronic Hepatitis B and C, Kaposi sarcoma, hairy cell leukaemia, malignant melanoma, renal cell carcinoma, condyloma acuminatum (genital warts).\nInterferon beta \n - used to treat multiple sclerosis.\nInterferon gamma \n - used to treat chronic granulomatous disease. \"They started me on a course of interferon-gamma and a set of new antivirals. I spiked one more fever the following night and then began a period of rapid improvement. My energy roared back. My appetite returned. I started sleeping through the night.\"  \n7) Why were the empathy and love shown by our loved ones during our quarantine very important? \nWe had seen multiple cases where the mothers, wives, fathers, husbands, daughters, and sons sacrificed their safety to make us comfortable when we were in quarantine battling the deadly coronavirus during the pandemic. We also have to remember that there was not even a single vaccine, and the hospitals were oversaturated with patients during the initial phase of the pandemic. Most of us are still alive only because of the love, care, and moral support shown by our loved ones during the time of crisis during the pandemic. The author beautifully conveys this emotional aspect through this novel.  \"It moved me that Ava would suit up to spend time with me inside my bubble. If you weren't used to them, a hazmat suit could be a claustrophobic experience. They were hot and bulky, and inevitably your face would begin to itch the moment you had entered the quarantine area. And, of course, looming over all of the inconvenience was the very real threat of a breach.\"  \n8) What is z-score? \nz- scores compare a person's bone density with the average bone density of people of the same age, sex, and body size \"Nothing's wrong per se. There's a metric called the z-score, which measures bone mineral density. Anything between −1 and 1 is within the range of normal. Your z-score is 2.75.\" \"Is that high?\" He chuckled. \"In my entire career, I've never seen bones this dense. This could explain the deep body pain you've been experiencing if they were undergoing a cycle of densification.\" \"What would cause an uptick in bone density?\" “Bad things. Diffusely metastatic prostate cancer, Paget’s disease, pyknodysostosis, osteopetrosis.”  \n9) What does the inhibition of PDE4B do? \nPDE4B gene encodes the enzyme cAMP-specific 3',5'-cyclic phosphodiesterase 4B. The significance of this inhibition is discussed in detail in this book.\"I shouldn't have known, but as I considered the question, I remembered reading an article eight years ago in Scientific American, where PDE4B had been discussed in the context of gene therapies for mental illness. I said, \"It's linked to  low anxiety and high problem solving . Well, at least in mice.\" \"Correct. It's been inhibited in you. What if I were to tell you that your entire IGF system had also been altered and your GRIN2B gene mutated?\" \n10) What is polygraph test? \nPolygraph test or the lie detector test records physiological phenomena such as blood pressure, pulse rate, and respiration of a person when he answers questions put to him by an operator\"I knew from my own experience in law enforcement that lie-detector tests don't actually detect lies. They detect guilty feelings, which most people experience when they lie, evidenced by dramatic swings in the metrics the tablet facing me was designed to track.\"  \n11) What is sensory gating? \nSensory gating is the capability of the human brain to separate irrelevant stimuli from relevant ones. \"What allows human beings to concentrate on things amid the maelstrom of infinite stimuli is a neurological process called sensory gating. It filters out low-relevance (redundant or unnecessary) stimuli in the brain from all possible environmental stimuli. If this didn't happen, we would experience an overload of irrelevant information in the higher cortical centers.The absence of sensory gating is a key marker for schizophrenia and actually contributes to making people go insane. An existence without gating would be torture.”  \n12) What are prions? \nPrions are proteins that can cause disease by abnormally folding proteins in the brain. Rapidly progressive dementia seen in Creutzfeldt-Jakob disease caused by prion is a serious medical condition.  \"Prions are misfolded proteins that carry a horrifying ability to catalytically transmit their misfolded shape onto normal variants of the same protein. These mutations cause normal proteins in the brain to misfold. They literally shred brain matter and cause a handful of horror-show neurodegenerative diseases. Victims lose their ability to recognize people and places and to take care of themselves. In the final stages, they cease to think at all.They cause But I watched in horror as the list of \"50%—95% overlap\" results scrolled by: scrapie, mad cow disease, camel spongiform encephalopathy (CSE), transmissible mink encephalopathy (TME), chronic wasting disease (CWD), feline spongiform encephalopathy (FSE), exotic ungulate encephalopathy (EUE), spongiform encephalopathy, Creutzfeldt-Jakob disease (CJD), Gerstmann-Sträussler-Scheinker disease (GSS), fatal familial insomnia (FFI), kuru, variably protease-sensitive prionopathy (VPSPr) and many other diseases.\"  \n13) What is R0 or R-naught? \nR0, in simple terms, can be described as the disease's spreadability.That was a very big number. In virology, the R0 (R-naught) indicates the contagion level of a given illness. It's the number of cases expected to be caused by a single infected person. Measles, the most contagious virus known to humankind, has an R0 of 12 to 18, which means that each infected person would be expected to infect 12 to 18 others. By comparison, the Spanish flu of 1918, which killed fifty million, had a much lower R0 of between 1.4 to 2.8.  COVID-19 had been around 5.7. \" \n \nMy favourite three lines from this book \n “The greatest threat to our species lies within us.”  \"Creatures who overlay story on everything, but especially their own lives, and in so doing, can imbue a cold, random, sometimes brutal existence, with fabricated meaning.\"    “But more than anything, I didn’t want to become someone’s lab rat.”   \nWhat could have been better?\nThere is too much Medical jargon in this book. Few of them I felt were unnecessary. For example, the author mentions the strain developed in Logan's adductor policies, first dorsal interosseus, and flexor policies brevis. He could have easily said it in a simpler way, like Logan was finding strain in his hand. I was ok with all the medical jargon as I am familiar with most of them. But I don't know about the case of others who are not too accustomed to these terms. We can't point it out as a severe negative, though, as this book is written in a way that can be deciphered and enjoyed by everyone in their own way, even if they don't understand some of the scientific concepts mentioned in it.\nRating \n 5/5 This is a must-read book if you like to read sci-fi novels. I think this book and another book called Sea of Tranquility will probably win most of the awards in the sci-fi category this year.",
      "num_likes": "259",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "megs_bookrack",
      "num_reviews": "1,792 reviews",
      "num_followers": "12.1k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "5",
      "review_text": "**4.5-stars rounded up**After an incident on the job where Logan Ramsey is exposed to possible contaminants, he begins to notice slightly alarming changes happening within himself.He's better able to concentrate, requires less sleep, his bones are becoming stronger and more dense. What is going on? It reads almost like he is becoming a superhero.It's the near future and the U.S. government has formed a Gene Protection Agency and Logan is one of their field agents. The agency was developed because gene editing has become a serious threat to the planet.Logan has a lot of experience with gene editing, as his mother was one of the most influential scholars in the field. Unfortunately, not all of her projects ended well, leaving the family name tarnished.Logan has worked hard to build his reputation back and he is known as a solid agent. That's why the incident on the job hit him so hard.He's taken out of commission, but there's so much more involved. His genome has been hacked. Was he selected for the upgrade, or was it just coincidence he ended up on that site that day?We then follow Logan on the various stages of his upgrade, as he investigates who could be behind it and why. Ghosts from his past arise and a true cat-and-mouse game ensues with the fate of humanity at stake.Blake Crouch is the ultimate SF-Thriller writer. He's just so damn good. This story was a ton of fun to read. I loved contemplating the science behind it.Additionally, the gripping plot, intelligent writing and non-stop action made me a very happy girl.Honesty, I think nothing truly scares me more than certain advances in AI, technology and genetic manipulation. Thinking about how our future could be transformed by these advances, and in my mind it is always in a sinister way, is just fascinating to me.I do feel this one would be super accessible as far as his titles go. Recursion sort of blew my mind and I can see how some Readers could be intimated by it. Also, Dark Matter got a bit trippy, although I loved it.I think if you have never read Crouch before, this could be a great place to start to get a sense of his style. I definitely recommend it!Thank you so much to the publisher, Ballantine Books, for providing me with a copy to read and review. I truly appreciate the opportunity to dive into a little early.",
      "num_likes": "234",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Meredith (Trying to catch up!)",
      "num_reviews": "854 reviews",
      "num_followers": "13.5k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "“The future was here, and it was a fucking mess.”Upgrade is a sci-fi thriller about a man who is genetically upgraded and tasked with saving humanity.The plot is complicated and has many layers. The novel takes place in the future in which people are trying to survive the ramifications of “the great starvation.” The plot is divided into three parts, all narrated by Logan, a man who works to put scientific criminals attempting to genetically engineer genes in jail while at the same time living with being the son of the scientist who caused the great starvation. He is a complicated and compelling character, but at the same time, he is cold and distant. At times, I didn’t fully connect with him.Of the three parts, I liked part one the best. Part two slowed down my reading momentum. Part three brought everything together and posed some provocative questions about humanity. This is a fast-paced, action-packed read filled with suspense, drama, and lots of science. There were times when the science was too much, but I think I understood the scientific threads more in this book than in Crouch’s other books, so that was a win for me. There are many layers to this novel. It is more than about a man trying to save the world, and one can apply the events that occur to the current state of the world. The overall message is profound and impactful, especially in response to those lacking compassion and empathy for others.“You can’t kill humanity to save humanity. Human beings are not a means to an end.”I received an ARC of this book from NetGalley and the publisher in exchange for an honest review.",
      "num_likes": "219",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Matt (Fully supports developing sentient AGI)",
      "num_reviews": "102 reviews",
      "num_followers": "26",
      "num_books": null
    },
    "review_info": {
      "star_rating": "3",
      "review_text": "My main impression - Upgrade was written for future movie adaptation instead of satisfying the reader.",
      "num_likes": "205",
      "num_comments": "2"
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "jessica",
      "num_reviews": "2,572 reviews",
      "num_followers": "43.3k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "not my favourite novel by BC, but definitely an action-packed adventure, and something i think would do well in film format.and thats probably why i didnt enjoy this as much as i have with BCs books in the past. its so fast-paced, to the point where i was racing through the pages. like, there were times when i realised i was reading so fast (because the story is constantly on the move) that i had to go back and reread sections because i just blazed right through them. lol.so its no surprise this story is 100% plot focused and the characters definitely take a back seat to this. not a deal breaker by any means, but because of the lack of character development and short length of the book in general, this definitely gives off “short story” vibes, rather than the feel of an in-depth novel. but its perfect if you are wanting something quick with full speed action surrounding a very intriguing sci-fi plot where someone wants to genetically upgrade the human race. its entertaining, for sure.↠ 4 stars",
      "num_likes": "198",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Will Byrnes",
      "num_reviews": "1,327 reviews",
      "num_followers": "121k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "My mother had tried to edit a few rice paddies and ended up killing two hundred million people. What havoc could she wreak—intentionally or through unintended consequences—by attempting to change something as fundamental as how Homo sapiens think?\n--------------------------------------\nWe were a bunch of primates who had gotten together and, against all odds, built a wondrous civilization. But paradoxically—tragically—our creation’s complexity had now far outstripped our brains’ ability to manage it.\n OK, so if you had the chance to upgrade yourself, would you do it? I know I would. There are so many things about me that could be better. But, as we all know from the constant barrage of upgrades offered by the makers of every bloody piece of software, some have downsides. Such as new, bloated code slowing down your app. A feature you liked has been removed. You now have to endure ads. Are the benefits of greater value than the costs? Sometimes, but usually, we won’t actually know until the new version is installed, which can take anywhere from minutes to “really, this fu#%ing thing is still processing?” Sometimes, you have no choice, the app updates whether you want it to or not. Blake Crouch - image from his site I suppose agent Logan Ramsay could tell us something about that last case. On a raid, he walks into a planned trap, which goes boom, and Ramsay is infused with version 1.0 of something, which gets busy rewriting his internal code to produce version 2.0 of Logan. There are upsides and downsides. This is no steroidal enhancement, trading zits and rage for increased muscle mass. A nifty bit of tech called a gene driver, (can’t help but see a tiny Uber with double-helix treads) is busy re-writing his actual DNA. (For a new you, no really, a totally, completely new you, call…1 800 FIX-THIS. Of course, we have a la carte if there are only some minor changes you would like. Operators are standing by.)Logan already had a complicated life. Mom was a geneticist trying to improve crop yields in China when there was a slight bit of collateral damage. Her altered-DNA material went where it was not supposed to. Oopsy. It was known as The Great Starvation. As noted in the quote at top, over two hundred million dead. Junior, who had been working with Mom, dead in the ensuing mess, wound up taking undeserved legal heat in her place, spent time in prison, but was sprung three years in. Now he works as an agent for the federal GPA, or Gene Protection Agency, (too late for Wilder) fiddling with genetic code having become a serious, felonious no-no, and Junior wanting to make amends for his family’s role in the global debacle. He is a geneticist like Mom, now dedicated to seeing that it never happens again. So, what happens in every single film and book in which our hero is altered by some weird outside force? They are dragged into enforced isolation for relentless study. Or base their subsequent actions (FLEE!!!) on the presumption that this is what the powers that be have planned for them.Of course among the changes that have been implanted into Logan is a significant increase in IQ. His perceptions have been enhanced as well, giving him a wider bandwidth for incoming sensory information and a much improved ability to process that new flow. This is both a chase and a pursuit story, as Logan must stay out of the clutches of the government, while searching for a dangerous geneticist, trying to stave off another potential global disaster. His personal upgrades make both running and chasing less of a challenge for him than it might be for an unaugmented person.Crouch offers a steady, if light, sprinkling of tech changes, letting us know we are in the future, if not necessarily the far distant future. Some seem more distant than others. Hyperloop, for example, is a widespread viable transportation mode. There is a mile-high building in Las Vegas. \nThe book is set slightly in the future, because I wanted to accelerate where some of the climate change and more in-the-weeds technology was heading, but it’s a mirror of where we might be five minutes from now. - Time interviewSome of the alignments seemed out of kilter. The story takes place in the 2060s. But delivery drones and driverless taxis hardly seem much of an advance for forty years. Ditto electric cars with greater range. Mention is made of a Google Roadster. Google producing its own car has been a project in the works since 2009. So, maybe only five minutes into the future for a lot of the tech Crouch employs. The five-minutes vs forty-years lookahead was jarringly inconsistent at times, which pulled me out of the story.He also reminds us, with a steady stream of examples, that the underlying issue is humans having screwed up the Earth to the point where the continued viability of Homo Sap is called into question. Lower Manhattan and most of Miami are under water. Glacier National Park no longer features glaciers. Many wildlife species are only memories. It is raining in the Rockies instead of snowing. There are now seven hurricane categories.There are some things about this book that I would change. There is an escape scene in which I found the means of egress a bit far-fetched, given the year in which it takes place. Surely there is better tech available? I kept wondering who got Logan sprung from prison. If it was revealed, I missed it. I wondered, during a flight from hostile forces, at how little pursuit of the runner there was by the pursuing forces. Really? That easy to get away? I don’t think so. A couple of lost family members merited a bit more attention. And there is a decided absence of humor. Expected questions are raised. Things like what is it that makes us human? There are those who believe that enhancing, upgrading humanity’s intelligence-related genes to stave off the potential extinction of our species is the only solution, regardless of what collateral damage that might entail. If we are smarter, goes the theory, we will see that what we are doing is madness, and find more sustainable ways of living. While that notion is appealing, it seems pretty glaring that an intelligence boost alone will not cut it. I mean, so you make people smarter. What could possibly go wrong? Logan addresses this:\nWhat if you create a bunch of people who are just drastically better at what they already were. Soldiers. Criminals. Politicians. Capitalists?\nThe notion has been done a fair bit.  Forbidden Planet is the classic of this sort. That most of the genetic manipulators in this tale ignore this suggests that maybe they were not so smart as they thought they were, enhanced or not. Might it enhance one’s appreciation of Upgrade if one had read his prior sci-fi thrillers? No idea. Have not read them. Cannot say. My unaugmented research capacities tell me, though, that this is a stand-alone, so at least there is no direct story or character connection to his prior work.Upgrade is a fast-paced thriller that keeps the action charging ahead. I often found myself continuing to read beyond where I had planned to stop. Logan is a decent guy who struggles with moral decisions in a very believable way. There are reasons to relate to him as an everyman, regardless of who his mother may have been. Crouch offers character depth enough for this genre. The tech never gets extreme, a beautiful thing. The concerns raised are very serious. Hopefully, it will boost, if not your muscle mass and speed in the forty, your interest level in the world of genetic manipulation, which, albeit with the best of intentions, could wind up degrading us all. \nTIME: You did a ton of research on gene editing for Upgrade. Was there anything you learned that stood out?Blake Crouch: The big thing I came away with is how afraid scientists are of this research and this technology. I didn’t realize how unnerved everyone was about both the optimistic potential of this technology—but also the pitfalls that await us.\nReview posted – August 5, 2022Publication dates----------Hardcover – July 19, 2022----------Trade paperback -June 27, 2023I received an ARE of Upgrade from Penguin Random House in return for a fair review, and not trying to change too much. Thanks, KQ, and thanks to NetGalley for facilitating. \n\n\n\n\n\n\n\nThis review has been, or soon will be, cross-posted on my site, Coot’s Reviews. Stop by and say Hi!=============================EXTRA STUFFLinks to the author’s personal, FB, and Twitter pagesFrom the bookBLAKE CROUCH is a bestselling novelist and screenwriter. His novels include Upgrade, Recursion, Dark Matter, and the Wayward Pines trilogy, which was adapted into a television series for FOX. Crouch also co-created the TNT show Good Behavior, based on his Letty Dobesh novellas. He lives in Colorado.Interviews-----Time - Blake Crouch No Longer Believes in Science Fiction - by Anabel Gutterman-----Paulsemel.com - Exclusive Interview: “Upgrade” Author Blake CrouchSongs/Music-----“Träumerei,” from Schumann’s Scenes from Childhood - Noted in chapter 6 as Logan’s favorite tune – if he says so-----Bowie - Changes - a live version from 1999 – just because----- Yamer Yapchulay - playing a violin cover of Tonight from West Side Story - one was played in Chapter 15-----Kyla - I Am Changing - you can thank me laterItems of Interest-----Carson National Forest - a hideout-----Quantum annealing computing - mentioned in chapter 7-----LifeCode is mentioned in chapter 9",
      "num_likes": "192",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Veronica Roth",
      "num_books": "50",
      "num_followers": "461k",
      "num_reviews": null
    },
    "review_info": {
      "star_rating": "5",
      "review_text": "I got to read this one in January and absolutely powered through it-- a really engaging, interesting read. Here's the quote I came up with...\"Blake Crouch doesn't pull any punches in this taut and evocative examination of what humanity really is-- and how it fails us. Upgrade is a hugely entertaining and emotionally resonant thriller that you'll be thinking about long after you turn the last page.\"Truth!",
      "num_likes": "184",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "karen",
      "num_reviews": "3,994 reviews",
      "num_followers": "171k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "NOW AVAILABLE!this is the third of blake crouch's \"more science than u\" books i have read, after Dark Matter and Recursion. i am neither a science person nor a science fiction person, but i'm fine to just roll with it, trusting that crouch has done enough research to make his science parts work, so i never get bogged down by the stuff i don't understand (i.e.—most of it), because he always manages to wrap a gripping human-interest story around the science-y bits for smol-brain folks like me. and this one should be particularly comforting to dum dums; illustrating that even smart people don't always feel smart enough; with its hero logan ramsay (IQ 118; degrees in biochemistry and genetics), floundering in the intellectual shadow of his mother (IQ in the low 180s): All I had ever wanted was to follow in her footsteps. I'd been chasing them all my life, and acknowledging the limitations of his own comparatively flabby intellect: I had extraordinary dreams and an ordinary mind.geniuses: they're just like us! so once again i leave the facts and figures to crouch's research team—i'm here for the scientific ethics; that old mad-scientist jurassic park-y hubris around what we CAN do and what we SHOULD do. years before this novel opens, logan's genius mom miriam DID do something that had unintended consequences—while she and her team (incl. logan) were trying to eradicate a bacterial leaf blight in china, an unexpected mutation occurred that caused The Great Starvation; a famine that killed 200 billion people. miriam died in a car crash before the full impact of the mutation occurred, and logan was imprisoned for three years for his part in the disaster. afterwards, he gave up on his dreams of becoming a geneticist, instead becoming a committed family man and working for the GPA (the Gene Protection Agency), an organization targeting criminal geneticists operating rogue gene labs creating new species as designer pets (!GIMMIE!), or using their knowledge to weaponize or enhance a human's DNA, which can be smuggled via—wait for it—BOOKS!I was looking for rigidity in the pages, signs they'd been wet at some point, infinitesimal circular stains. Vast amounts of DNA, or plasmids, could be hidden on the pages of a normal book—dropped in microliter increments and left to dry on the pages, only to be rehydrated and used elsewhere. even a short novel like The Stranger could hold a near-infinite amount of genetic information, with each page hiding the genome sequence for a different mammal, a terrifying disease, or a synthetic species, any of which could be activated in a well-equipped dark gene lab.so cool. what is NOT cool is that, while on a job, logan is exposed to something that modifies his genomes. like, all of his genomes. after his nonconsensual genetic upgrade, he's become a brainy-bourne: stronger, faster, smarter, more resilient, with increased bone density, perfect recall, and oh my god—the ability to speed-read two books at once (!GIMMIE!). it's not all great, though—post-exposure, logan is held against his will; a government-caged secret for observation purposes, and his wife and teenage daughter have been told he's dead, so that's a drag.however, logan wasn't the only one exposed to this instant-evolution process, and he gets broken out of science-jail by a fellow-upgrade and, after some complicated family baggage is dragged into the light, he finds himself tasked with a daunting mission: to save humanity from itself.it's a pretty big ask, and, faced with this difficult decision, logan is naturally conflicted about his next steps; a little science-shy over the ethics or consequences of bringing the human race up to his new level, which is already proving to have its downsides: his transformation has made him more efficient and intelligent than everyone around him, but consequently more impatient and less empathetic with normies.additionally, he's still grappling with his mommy-issues: he's finally reached, maybe surpassed, his mother's intellect, but is hesitant to make the same mistakes she made. We had gotten so much right.And too much wrong.The future was here, and it was a fucking mess.Upgrade is a delicious blend of action and ethics, rich with family drama and redemption, where the real hero of the piece is emotional intelligence. We were a monstrous, thoughtful, selfish, sensitive, fearful, ambitious, loving, hateful, hopeful species. We contained within us the potential for great evil, but also for great good. And we were capable of so much more than this.it's just as fun and thought-provoking as his other books, but i gotta say, some of logan's genius-level observations sound pretty close to the insights of college stoners:We walked back to the hotel under a deep navy sky bejeweled with stars.In the center of the plaza, a choir was singing. They held quivering candles, and their voices lilted icily into the sky. I didn't see the moment. Not really. I saw the story behind the moment—a tale passed down over two thousand years that told of a child of a superbeing sent to save the world. Never before had I seen Homo sapiens so clearly—a species, at its most fundamental level, of storytellers.Creatures who overlay story on everything, but especially their own lives, and in so doing, can imbue a cold, random, sometime brutal existence, with fabricated meaning.stoner-geniuses will save us all. but should they?? come to my blog!",
      "num_likes": "164",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Nataliya",
      "num_reviews": "849 reviews",
      "num_followers": "14.1k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "3",
      "review_text": "“We were a monstrous, thoughtful, selfish, sensitive, fearful, ambitious, loving, hateful, hopeful species. We contained within us the potential for great evil, but also for great good. And we were capable of so much more than this.”\nAs genetic manipulation is slowly but surely leaving the science-fictional realm and possibility of genetically enhanced humans is close enough to start raising real ethical issues (the idea of unenhanced genetically “inferior” class vs superhuman rich who can afford it, raising inequalities to cellular levels, for instance), books like Blake Crouch’s Upgrade make me consider where I’d fall on that spectrum. What would I do or want to see done? We all would probably embrace eradicating genes that cause diseases, especially in kids, but where is the stopping point? When does enhancement stop being good enough and becomes too much? And how better would the world be if we had means to fix things that cause us problems? After all, we all know humans are imperfect, so why wouldn’t you want to improve things and help fix the screw-ups we did to our world? “I had extraordinary dreams and an ordinary mind,” a character thinks. But why do we have to hang onto the ordinary? We as a society have been fascinated by the idea of superhuman, superheroes for a while - certainly long enough for Marvel to create a whole profitable universe of them - but what if we had the means to try to upgrade us all?Is hanging on to the present imperfect genetic status quo really just plain old fear of changes?\n “Put simply: Our situation was fucked, and we weren’t doing enough to un-fuck it.”\nAnd another issue here is: how far can we go for the sake of population benefit? How much can be sacrificed individually for the benefit of the many if it means sacrifice of the few? Saving the majority at the expense of the minority — should we be thinking individualism vs species survival? Maybe the answer will depend on which side of that divide you fall — but do you have a choice in that? And who gets to decide and police that?And can we actually solve our problems if we all were just better at being us? Would we be smart enough to stop screwing up, or would we just start screwing up on a more epic scale? Being brilliant does not after all make you any less of an asshole; it may actually have a very much opposite effect.\n“What if this isn’t the solution? What if you end up killing a billion people for no reason? What if you just end up creating a world of Miriam Ramsays—all convinced they know what’s best, all capable of inflicting unimaginable harm if they’re wrong? What if you create a bunch of people who are just drastically better at what they already were. Soldiers. Criminals. Politicians. Capitalists.”\nThere are no correct answers here, but Blake Crouch presents one possible scenario, and he does it well. Certainly entertaining, easy to read, very accessible, and zipping along at a frantic pace which nevertheless is easy to follow. The science is explained at a very simple level, so no genetic upgrades are necessary for it all to be crystal-clear.“I could read a book with my eyes while simultaneously listening to an audiobook, and comprehend each one to a seventy percent degree of accuracy.”Yes, please. That would make Goodreads even more fun.It’s an entertaining and a fast-paced adventure, but although I had tons of fun reading it, zipping through it in a few hours, I anticipate that it will fall out if my memory relatively fast, too. But it can make a fun summer blockbuster movie if ever put to film. And ultimately it stops short of being unsettling or digging too deep, instead feeling like an eventual comfort read. It’s language and the entire story cadence seem made for a pleasant and fast summer read, a few hours well-spent but perhaps not that memorable in the longer run.\n“Being smart doesn’t make people infallible. It just makes them more dangerous.”\nI’m curious to try more Blake Crouch though. Even if not life-changing, this was interesting and fun enough.3.5 stars.——————Also posted on my blog.",
      "num_likes": "156",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Misty Marie Harms",
      "num_reviews": "559 reviews",
      "num_followers": "580",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "Why is it every time I read Crouch, I feel like I took an advanced course in science I was in no way prepared for? This is an action packed thriller that will keep you on the edge of your seat. I can see this happening in the distant future. What a scary time that would be to live in. Recommend!",
      "num_likes": "155",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Kay ☘*¨",
      "num_reviews": "2,173 reviews",
      "num_followers": "1,074",
      "num_books": null
    },
    "review_info": {
      "star_rating": "5",
      "review_text": "4.5⭐I think I talked myself into upgrading the rating from 4 to 5 stars! 🤩🤣How is this even possible when I wanted to return this book?! Honestly, I couldn't get into it in the beginning. Unlike his other books that pulled me in from the first page, this one didn't. But because they were library loans, I didn't want to go through the hassle again. The moment that piqued my interest was when the protag's mother, a renowned geneticist who tried to end world hunger accidentally kill 200 million people! Logan Ramsay who's helping her got prison time. Gene editing is too risky and illegal. (But wouldn't it be nice if all mosquitos were male?😅) If you read the blurb, Logan doesn't feel like his old self. He feels much better in every way. But he's not the only one. Another person who doesn't see eye to eye with Logan-the Gene Police feels just as sharp and even more capable physically. Logan must stop them and avert world disaster.Although the future doesn't look beautiful (flooded ghost town NYC), I still love the world Crouch creates. The tech, transportation, and other little things made it very believable. The story is set in a not too distant future. My guess is 2068 (based on publishing date, or a few years earlier depending on when it was written. page 296; 140 Broadway Street)Needless to say, I can't wait for this story to be on the big screen and Hollywood loves this kind of ending. Upgrade will make one helluva movie! I pray the deal with Spielberg comes to fruition. 🤞",
      "num_likes": "159",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "LIsa Noell \"Rocking the Chutzpah!  ",
      "num_reviews": "663 reviews",
      "num_followers": "396",
      "num_books": null
    },
    "review_info": {
      "star_rating": "3",
      "review_text": "My thanks to Random House/Ballantine, Blake Crouch and Netgalley. I didn't like this book much. That's an oddity for me, as I've loved darn near everything that I've read of Blake's since I discovered him back in 2013. I suppose it was bound to happen. That's not to say that I wasn't interested in this story. I liked the story well enough. What I absolutely hated was all that DNA science. I was bored to death! I kept falling 😴 asleep! That has never happened with a Crouch story before. Yeah. I'm giving this one a soft pass. I see other reviewer's think it's great. So, don't let my boredom deter you!",
      "num_likes": "148",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "PamG",
      "num_reviews": "995 reviews",
      "num_followers": "673",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "Upgrade\n by Blake Crouch combines genetic engineering science fiction with a techno-thriller. Logan Ramsay and his partner Nadine Nettman work for the Gene Protection Agency (GPA). They are with a SWAT team looking for an illegal genetics laboratory. Logan is the first one in the basement. An explosion causes shrapnel to puncture his hazmat gear. He wakes up on the hospital infected by a virus; one designed to modify his genetic structure. The virus soon disappears and Logan returns to work. However, he is noticing changes. His bone density increases and he’s getting smarter with better concentration and a photographic memory. With this as a starting point, I believe it’s better if readers go into this with little knowledge of what is to come.Logan is a nice person that has had a rough time of it during the last few years, but he has a loving wife and daughter. He hates his job, but doesn’t know what else he would do. He’s the son of Miriam Ramsey who killed millions when a genetic experiment went wrong. His character experiences extreme growth in many ways during the course of book. The other characters provide support or opposition and include law enforcement, military personnel, co-workers, and family members.The story is engaging and suspenseful, keeping me turning the pages. There is a lot of information about genetics, but that is something that interests me. The plot is shocking and the action amazing. This is a science-based thriller set in the future and it has some unexpected twists and turns. My one quibble is that there is some slower pacing in the middle of the book. It doesn’t last long and maybe readers need that breather before the astonishing second half. Themes include genetic engineering, experiments, family, trust, betrayal, and much more.Overall, this was an entertaining, appealing, and somewhat scary novel when one thinks about the possibilities of what can go wrong with genetic engineering. There are some pivotal stressful and emotional times. I am looking forward to reading more from this author.Random House Publishing Group – Ballantine and Blake Crouch provided a complimentary digital ARC of this novel via NetGalley. This is my honest review. Opinions are mine alone and are not biased in any way. Publication date is currently set for July 12, 2022.--------------------------------------------------Review to be posted around June 28, 2022 (per publisher guidelines).",
      "num_likes": "141",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Ginger",
      "num_reviews": "843 reviews",
      "num_followers": "441",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "ARC provided by the publisher in exchange for an honest review via NetGalley.4/4.5 stars!This was another winner from Blake Crouch in my opinion!Logan Ramsay makes for an interesting main character.In the beginning of the book, I felt an emotional connection to him and then again at the end.In the middle of the book, I did not connect to him as much, but I feel like that’s the entire point in the book.Without giving too much away, I love how Crouch shows us the benefits of DNA adaption and upgrades, but also shows how the upgrade will cause us to lose our humanness and feelings for people and memories.When Logan gets targeted with an upgrade to his DNA composition, he becomes more conscious, hyper focused and driven in his decisions.But with this upgrade, he also becomes less emotional about his actions, thoughts, and the important people in his life.The pacing in Upgrade lags a bit in the middle but the ending and epilogue brings up the emotional enjoyment for me.In fact, I was a bit emotional with how the book ends and things wrap up for Logan Ramsay.Overall, the DNA dumping and science information was a bit much, but it does not take away from the overall plot and emotional connection that I felt for the characters.I really love how Crouch shows us the benefits of how to save humankind and earth with this new sci-fi thriller!Definitely get to this one if you love sci-fi themed books and ideas that look at the bigger picture when it comes to saving the world!",
      "num_likes": "139",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Linda",
      "num_reviews": "1,404 reviews",
      "num_followers": "1,501",
      "num_books": null
    },
    "review_info": {
      "star_rating": "5",
      "review_text": "You can change your mind.....in more ways than one.Blake Crouch is my guy when it comes to scientifically themed novels. He is beyond brilliant when it comes to lining up the chairs of science alongside the necessary popcorn of a great human interest storyline. Crouch extends his hand and leads us through the heavy-duty elements that lie herein. He never lets the Bunsen Burner go out.Agent Logan Ramsay works as a scientist for the Gene Protective Agency (GPA). Gene editing has become a federal crime. We're now a few years out from The Great Starvation in a post famine world. A profound impact has occured from tampering with and subverting the original intent of a gene's function. Scythe had become a biological DNA modifier system. In the wrong hands, genetic fingerprint labs have the potential to release pathogens like mad terrorists.Logan and his UNESCO partner, Nadine, have gotten a tip on such a lab. As they enter inside, an explosion happens and ice-like particles break through his hazmat suit. As a precaution, Logan is hospitalized and tests are run. Initially, all seems to be well. But eventually, the tests come back with rapid changes to his genetic coding. Logan's fear is one of trust. He's not even sure if he should divulge his newly gained enhanced learning and spatial capabilities along with his higher cognitive function abilities. His mind is speeding at an astounding rate. But someone is taking notice and Logan is kidnapped from his room. He's held like a prisoner and his blood is drawn every nano second. His wife Beth and daughter Ava have no clue as to what has happened. And here's where Blake Crouch shuffles the cards at a rapid pace. Someone knows the inner workings of Logan up close and personal and would profit greatly from a genome analysis of the new and improved Logan. Crouch gives the readers plenty of evil options here. But which one?If you've not had the pleasure of reading a Blake Crouch novel, check out Dark Matter and Recursion. They are top-notch and attention getting. Crouch will make a scientific believer out of you yet.I received a copy of this book through NetGalley for an honest review. My thanks to Random House Books and to the talented Blake Crouch for the opportunity.",
      "num_likes": "138",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Holly  B (Short Break)",
      "num_reviews": "879 reviews",
      "num_followers": "2,413",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "GPA = Gene Protection Agency \"I didn't want to become someone's lab rat.\"Logan has been targeted with an \"upgrade.\" He could feel his neurons firing, his IQ shot up to at least two hundred, his memory seemed to be preternatural.\"What am I. What am I becoming.\"I was really into the fast action on steriods, and could feel Logan's tension as he wondered what he had been infected with and if his genetics were altered. He is having wild dreams, new emotions about the changes he is experiencing. He is filled with ecstasy, euphoria, horror, terror and joy all at once. Can Logan save humanity? Does it all come down to him?Expect the usual mad science, genre blending, tense, and wild \"think outside the box\" read that Crouch does so well! The pace does plod a bit in the second half with all the genetic lingo, BUT still a roller coaster story, a little frightening (especially after the real life pandemic), but well worth the read. Go Logan!!Thanks to NG and Ballentine for my arc. OUT July 12, 2022",
      "num_likes": "135",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Emily (Books with Emily Fox on Youtube)",
      "num_reviews": "578 reviews",
      "num_followers": "64.8k",
      "num_books": null
    },
    "review_info": {
      "star_rating": null,
      "review_text": "👀",
      "num_likes": "131",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Paromjit",
      "num_reviews": "2,918 reviews",
      "num_followers": "25.4k",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "Blake Crouch's latest offering in an exciting, brilliant and thought provoking sci-fi thriller that focuses on the challenges facing human survival, evolution and the field of genetic engineering. Set in the future where in the US gene editing has been banned, Logan Ramsey, works for the Gene Protection Agency (GPA), he finds himself being 'upgraded' after his presence at an explosion and he becomes transformed by a synthetic virus. We become immersed in the mind boggling changes that start affecting Logan slowly, but he is not the man he used to be. As Logan escapes, he finds himself on a mission to save the world. We learn of his background, particularly his notorious, if genius mother, Miriam, in this well researched and riveting narrative that explores the ethical and moral issues associated with gene editing, the prioritising of intelligence at the expense of all those qualities that contribute to what makes us human, such as kindness and compassion. The scientific details in the story may put some readers off, but others are likely to find them both helpful and informative in this action packed read with its timely look at the current issues facing the survival of the human race. Many thanks to the publisher for an ARC.",
      "num_likes": "129",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Elle",
      "num_reviews": "587 reviews",
      "num_followers": "1,763",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "Now a Goodreads Choice Nominee in Science Fiction!!\n“They know you’re changing.”It all happened so quickly. Following a tip from the GPA, the Gene Protection Agency, they went into the building equipped body armor, hazmat suits and a full SWAT team. He was a scientist, not a soldier. He was going to call his wife in the morning; he was supposed to go home. But a flash, an explosion—and then Logan Ramsay was changed forever. And with him, so was the rest of the world.The planet has evolved so quickly. What once felt like slow march towards the inevitable has accelerated into a sprint. Logan joined the GPA as a way to make amends for his mother’s role in the gene editing scheme that snowballed into an ecological disaster. The old Logan would have never considered taking part in something like that, and he wouldn’t have had the capacity to. But after the botched raid, Logan is different now, and there’s no telling what he’s willing and capable of doing.Upgrade is exactly the sort of book that I’ve come to expect from Blake Crouch. A dynamic, fast-paced thriller nestled comfortably between grounded sci-fi and speculative fiction. There’s the ‘regular guy’ protagonist that gets thrust into the center of rapidly unfolding, almost supernaturally daunting events that have to power to shape the world as we know it. And through that vehicle Crouch offers a commentary on what he believes is one of the most pressing issues of our time. In this case, that’s climate change, but a little more broadly it’s human indifference to the effects of climate change and other impending disasters. For the most part, it’s spectacularly done. Crouch has a way of making the implications of a far-off technological advancement feel like it’s just around the corner. You just can’t help but rip through the pages, desperate to reach the end. Upgrade is the kind of book tailor-made for a big budget movie adaptation, staring whatever 30-40 year-old white leading man is currently in demand. This was an easy 5 star book for me. Sure, it’s a very American worldview. It’s a white guy on a Save The World™ mission, humanity’s last hope and all that. There’s nothing wrong with being a popcorn thriller with a strong message, despite what some lit snobs might believe. So why, then, does this review have four stars? Well, I literally cannot tell you. Not without massive spoilers. So please, PLEASE do not expand this spoiler text below unless you have read it already. Or are a masochist—but at that point you can’t yell at me for ruining it!!I was all in on this, even in the epilogue, up until that final letter that Logan wrote to his wife and daughter. What a fumble on the 1 yard line (is that right?? idk I don’t do sport metaphors). Explain to me how you can write an entire novel about the dangers of messing with humanity. About how one tiny change can have devastating, unforeseeable consequences—but you decide to solve the question of humans by once again having an entitled, know-it-all character play god on people against their will. Crouch has completely undermined his entire thesis in just a couple of pages of half-assed grandstanding. The fact that Logan could witness and face the consequences of his mother’s actions as well as literally murdering his sister to prevent her from acting, and then take it upon himself to do the same goddamned thing is a total collapse of his character arc. There’s no coming back from that; he’s now irredeemable.I don’t even totally disagree with his point that it’s a lack of compassion that has (and will) lead human societies towards our own downfall, but I do vehemently challenge the notion that we all bear the same level of responsibility. It’s not all humans who need to be “upgraded”; it’s the powerful decision makers. There’s ample evidence that when people have been at their lowest and most vulnerable, that the communities who step up and help are the ones who have the least. And those that don’t help aren’t doing so out of apathy, but because they are simply struggling to survive themselves.So the idea that humanity as a whole needs to be ‘fixed’, by possibly the worst candidate for White Savior since Hollywood decided to sing Imagine for us, is just incorrect. If Crouch was dead-set on this “compassion upgrade”, which I think is in moral opposition to the rest of his novel but whatever it’s his book, he could have aimed it to target a small number of influential people in high-income countries. But making it a contagion, spreading it to people without their knowledge, altering their chemical makeup without their consent, all based off of a technology that only a couple of years before had a 13% mortality rate—are we supposed to clap?? I swear if some mad scientist dude-bro reads this and decides to use it as a blueprint in the future, Blake better be long gone because I will be KNOCKING on his door!Even with that complaint, though, Upgrade is monstrously entertaining. My reading speed essentially doubled whenever I picked it up, so for that reason I still feel compelled to recommend it. But it’s not going to top the list for me this year, and I can’t help but express disappointment at Crouch’s final word on the subject. I do hope other people read it when they get the opportunity to as I’m very eager to discuss it more.",
      "num_likes": "120",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "JanB",
      "num_reviews": "1,210 reviews",
      "num_followers": "3,474",
      "num_books": null
    },
    "review_info": {
      "star_rating": "5",
      "review_text": "The time is in the not-too-distant, somewhat dystopian future where gene technology has been developed to the point where nearly anything is possible. Logan Ramsay, an agent with the Gene Protection Agency (GPA), works diligently to prevent illegal gene technology from being used for nefarious purposes. He’s rather average, working his job, a family man who deeply loves his wife and daughter and attempts to keep his head down low due to a tragedy in his past. During a raid on an illegal lab his genome is hacked, infected with a virus that results in an “upgrade” that results in mental and physical enhancements.  At first glance this sounds great, right? Who among us couldn’t use a bit of an upgrade? I know my memory could use one. But be careful of what you wish for. What happens to the essence of what it is to be human?  I won’t give away any more details of the plot, as it’s such fun to discover for yourself. But there are reasons that Logan has been chosen for the upgrade, and the repercussions have far-reaching consequences. Those who think the way to save humanity by upgrading all humans, will be pitted against those who think you can’t save humanity by destroying humanity. Logan is an easy character to root for as you watch him make difficult and personally devastating choices.  There is a heavy dose of science, which readers will either find fascinating or will gloss over. Whichever you choose to do doesn’t matter as this is as much a crime thriller as it is sci-fi, and is enjoyable either way. I can’t say if the science is accurate, but it certainly made for a thrilling, suspenseful tale. The author takes familiar themes rooted in reality and gives them his own fresh twist. But the science and philosophical questions never overwhelm good storytelling. I loved Dark Matter, and with this book, I’m officially a superfan of the author’s. This was a buddy read with Marialyce and one we both highly recommended! Do check out her review.* I received a digital review copy via NetGalley, all opinions are my own.* I also listened to the audio and Henry Levya did an excellent job narrating",
      "num_likes": "123",
      "num_comments": 0
    }
  },
  {
    "title": "Upgrade",
    "reviewer_info": {
      "reviewer_name": "Sujoya(theoverbookedbibliophile)- Lots of catching up to do! ",
      "num_reviews": "624 reviews",
      "num_followers": "2,097",
      "num_books": null
    },
    "review_info": {
      "star_rating": "4",
      "review_text": "Set in the not-so-distant future Blake Crouch’s Upgrade revolves around Logan Ramsay, an agent with the Gene Protection Agency (GPA). The GPA tracks the development and application of genetic research to prevent it from being used for any purpose that would be detrimental to the human race. This is a world where the application of genetics is highly regulated and gene modification or editing has been outlawed. Though the Gene Protection Act had effectively ended all private and university-based genetic research, some scientists and researchers have been continuing their work illegally. The GPA is responsible for tracking down and arresting illegal researchers and the closure of all underground research labs/facilities.Logan’s mother Miriam Ramsay had been a gifted scientist whose discovery of 'Scythe' - a revolutionary, biological DNA modifier system, had ushered in a new era of gene editing. However, her experiments with genetic modification resulted in The Great Starvation, a disaster that led to the death of millions of people, food shortages and economic ramifications that the world is still recovering from. Since then Scythe has been deemed illegal. Logan, in the process of a raid on a suspected rogue genetics facility, is exposed to the Scythe virus. He is quarantined while recovering from his injuries and a high fever that he recovers from. When test results reveal no other effects of his exposure, he is discharged and returns home to his wife and daughter . However, as the days progress, he notices changes such as improved memory and cognition. Genome analysis reveals that his cognition, memory, concentration and pattern recognition have been enhanced among other changes happening within his body . In other words, he has been “upgraded”.Under suspicion for self-injecting and illegal use of genetic modification tech, Logan goes on the run, learning to balance and hone his enhancements while trying to comprehend the full scale implications of all that has happened . Is his exposure a freak accident or was he targeted? Who is behind this advanced Scythe-like genetic modification sytem and to what end ? Was his exposure an isolated incident or is the world on the brink of another disaster? Who can he trust to help him find the truth? Blake Crouch’s Upgrade is a fast-paced, action-packed sci-fi thriller that is hard to put down. Though some of the science might be hard to understand, that hardly detracts from enjoying the suspenseful narrative. While I enjoy watching sci-fi movies, I haven’t read much in the sci-fi genre in the recent past but I’m glad that I got to read this novel. I had heard a lot of good things about Blake Crouch’s books and now I can see why. This was my first Blake Crouch novel and I look forward to reading more of his work.\tThanks to NetGalley, Kathleen Quinlan and Random House for the digital review copy in exchange for my honest review.",
      "num_likes": "119",
      "num_comments": 0
    }
  }
]