[
  {
    "title": "Trail of the Lost: The Relentless Search to Bring Home the Missing Hikers of the Pacific Crest Trail",
    "author": [
      "Andrea Lankford"
    ],
    "description": "From a former law enforcement park ranger and investigator, this female-driven true crime adventure follows the author’s quest to find missing hikers along the Pacific Crest Trail by pairing up with an eclectic group of unlikely allies. As a park ranger with the National Park Service's law enforcement team, Andrea Lankford led search and rescue missions in some of the most beautiful (and dangerous) landscapes across America, from Yosemite to the Grand Canyon. But though she had the support of the agency, Andrea grew frustrated with the service's bureaucratic idiosyncrasies, and left the force after twelve years. Two decades later, however, she stumbles across a mystery that pulls her right back where she left - three young men have vanished from the Pacific Crest Trail, the 2,650-mile trek made famous by Cheryl Strayed's Wild , and no one has been able to find them. It’s bugging the hell out of her. Andrea’s concern soon leads her to a wild environment unlike any she’s ever ventured into - missing person Facebook groups. Andrea launches an investigation, joining forces with an eclectic team of amateurs who are determined to solve the cases: a mother of the missing, a retired pharmacy manager, and a mapmaker who monitors terrorist activity for the government. Together, they track the activities of kidnappers and murderers, investigate a cult, rescue a psychic in peril, cross paths with an unconventional scientist, and reunite an international fugitive with his family. Searching for the missing is a brutal psychological and physical test with the highest stakes, but eventually their hardships begin to bear strange fruits—ones that lead them to places and people they never saw coming.",
    "series_details": null,
    "book_details": {
      "pages_format": "352 pages, Hardcover",
      "publication_info": "First published August 22, 2023"
    },
    "genres": [
      "Nonfiction",
      "True Crime",
      "Audiobook",
      "Nature",
      "Adventure",
      "Mystery",
      "Travel"
    ],
    "avg_rating": 3.77,
    "num_ratings": 8257.0,
    "num_reviews": 1056.0
  },
  {
    "title": "A Game of Gods",
    "author": [
      "Scarlett St.  Clair"
    ],
    "description": "Told in multiple POVs, A Game of Gods is the final installment in the Hades Saga by USA Today Bestselling author Scarlett St. Clair.Hades, God of the Dead, has finally made Persephone his in every way possible. With their wedding on the horizon, the couple should be ecstatic. But Demeter is wreaking havoc on their bliss by battering the whole of New Greece with erratic and dangerous weather. At the same time, Theseus continues with his agenda against the Gods, allying with the hate-group Triad in an effort to bring down all of Olympus.Hades refuses to allow anything to stop him from securing Persephone as his bride, but he must play a deep strategic game with the Gods of Olympus to safeguard their future. And it is not entirely clear which Gods are truly on his side.",
    "series_details": "Book 3 in the Hades Saga series",
    "book_details": {
      "pages_format": "592 pages, Hardcover",
      "publication_info": "First published July 25, 2023"
    },
    "genres": [
      "Romance",
      "Mythology",
      "Greek Mythology",
      "Fantasy Romance",
      "Fiction",
      "Adult",
      "Audiobook"
    ],
    "avg_rating": 4.06,
    "num_ratings": 15195.0,
    "num_reviews": 1181.0
  },
  {
    "title": "Yellowface",
    "author": [
      "R.F. Kuang"
    ],
    "description": "White lies. Dark humor. Deadly consequences… Bestselling sensation Juniper Song is not who she says she is, she didn’t write the book she claims she wrote, and she is most certainly not Asian American—in this chilling and hilariously cutting novel from R.F. Kuang, the #1 New York Times bestselling author of Babel. Authors June Hayward and Athena Liu were supposed to be twin rising stars. But Athena’s a literary darling. June Hayward is literally nobody. Who wants stories about basic white girls, June thinks.So when June witnesses Athena’s death in a freak accident, she acts on impulse: she steals Athena’s just-finished masterpiece, an experimental novel about the unsung contributions of Chinese laborers during World War I.So what if June edits Athena’s novel and sends it to her agent as her own work? So what if she lets her new publisher rebrand her as Juniper Song—complete with an ambiguously ethnic author photo? Doesn’t this piece of history deserve to be told, whoever the teller? That’s what June claims, and the New York Times bestseller list seems to agree.But June can’t get away from Athena’s shadow, and emerging evidence threatens to bring June’s (stolen) success down around her. As June races to protect her secret, she discovers exactly how far she will go to keep what she thinks she deserves.With its totally immersive first-person voice, Yellowface grapples with questions of diversity, racism, and cultural appropriation, as well as the terrifying alienation of social media. R.F. Kuang’s novel is timely, razor-sharp, and eminently readable.",
    "series_details": null,
    "book_details": {
      "pages_format": "336 pages, Hardcover",
      "publication_info": "First published May 16, 2023"
    },
    "genres": [
      "Fiction",
      "Contemporary",
      "Audiobook",
      "Literary Fiction",
      "Thriller",
      "Adult",
      "Mystery"
    ],
    "avg_rating": 3.79,
    "num_ratings": 477314.0,
    "num_reviews": 65204.0
  },
  {
    "title": "Hello Beautiful",
    "author": [
      "Ann Napolitano"
    ],
    "description": "An emotionally layered and engrossing story of a family that asks: Can love make a broken person whole?William Waters grew up in a house silenced by tragedy, where his parents could hardly bear to look at him, much less love him. So it’s a relief when his skill on the basketball court earns him a scholarship to college, far away from his childhood home. He soon meets Julia Padavano, a spirited and ambitious young woman who surprises William with her appreciation of his quiet steadiness. With Julia comes her family; she is inseparable from her three younger sisters: Sylvie, the dreamer, is happiest with her nose in a book and imagines a future different from the expected path of wife and mother; Cecelia, the family’s artist; and Emeline, who patiently takes care of all of them. Happily, the Padavanos fold Julia’s new boyfriend into their loving, chaotic household.But then darkness from William’s past surfaces, jeopardizing not only Julia’s carefully orchestrated plans for their future, but the sisters’ unshakeable loyalty to one another. The result is a catastrophic family rift that changes their lives for generations. Will the loyalty that once rooted them be strong enough to draw them back together when it matters most?Vibrating with tenderness, Hello Beautiful is a gorgeous, profoundly moving portrait of what’s possible when we choose to love someone not in spite of who they are, but because of it.",
    "series_details": null,
    "book_details": {
      "pages_format": "416 pages, Kindle Edition",
      "publication_info": "First published March 14, 2023"
    },
    "genres": [
      "Fiction",
      "Historical Fiction",
      "Audiobook",
      "Romance",
      "Contemporary",
      "Literary Fiction",
      "Family"
    ],
    "avg_rating": 4.17,
    "num_ratings": 321844.0,
    "num_reviews": 30397.0
  },
  {
    "title": "The Wishing Game",
    "author": [
      "Meg Shaffer"
    ],
    "description": "Make a wish. . . .Lucy Hart knows better than anyone what it’s like to grow up without parents who loved her. In a childhood marked by neglect and loneliness, Lucy found her solace in books, namely the Clock Island series by Jack Masterson. Now a twenty-six-year-old teacher’s aide, she is able to share her love of reading with bright, young students, especially seven-year-old Christopher Lamb, who was left orphaned after the tragic death of his parents. Lucy would give anything to adopt Christopher, but even the idea of becoming a family seems like an impossible dream without proper funds and stability.But be careful what you wish for. . . .Just when Lucy is about to give up, Jack Masterson announces he’s finally written a new book. Even better, he’s holding a contest at his home on the real Clock Island, and Lucy is one of the four lucky contestants chosen to compete to win the one and only copy.For Lucy, the chance of winning the most sought-after book in the world means everything to her and Christopher. But first she must contend with ruthless book collectors, wily opponents, and the distractingly handsome (and grumpy) Hugo Reese, the illustrator of the Clock Island books. Meanwhile, Jack “the Mastermind” Masterson is plotting the ultimate twist ending that could change all their lives forever.. . . You might just get it.",
    "series_details": null,
    "book_details": {
      "pages_format": "304 pages, Hardcover",
      "publication_info": "First published May 30, 2023"
    },
    "genres": [
      "Fiction",
      "Fantasy",
      "Romance",
      "Contemporary",
      "Audiobook",
      "Magical Realism",
      "Books About Books"
    ],
    "avg_rating": 4.1,
    "num_ratings": 116651.0,
    "num_reviews": 18454.0
  },
  {
    "title": "Tom Lake",
    "author": [
      "Ann Patchett"
    ],
    "description": "In this beautiful and moving novel about family, love, and growing up, Ann Patchett once again proves herself one of America’s finest writers.In the spring of 2020, Lara’s three daughters return to the family's orchard in Northern Michigan. While picking cherries, they beg their mother to tell them the story of Peter Duke, a famous actor with whom she shared both a stage and a romance years before at a theater company called Tom Lake. As Lara recalls the past, her daughters examine their own lives and relationship with their mother, and are forced to reconsider the world and everything they thought they knew.Tom Lake is a meditation on youthful love, married love, and the lives parents have led before their children were born. Both hopeful and elegiac, it explores what it means to be happy even when the world is falling apart. As in all of her novels, Ann Patchett combines compelling narrative artistry with piercing insights into family dynamics. The result is a rich and luminous story, told with profound intelligence and emotional subtlety, that demonstrates once again why she is one of the most revered and acclaimed literary talents working today.",
    "series_details": null,
    "book_details": {
      "pages_format": "309 pages, Hardcover",
      "publication_info": "First published August 1, 2023"
    },
    "genres": [
      "Fiction",
      "Audiobook",
      "Literary Fiction",
      "Romance",
      "Historical Fiction",
      "Contemporary",
      "Family"
    ],
    "avg_rating": 4.02,
    "num_ratings": 273297.0,
    "num_reviews": 33700.0
  },
  {
    "title": "The Five-Star Weekend",
    "author": [
      "Elin Hilderbrand"
    ],
    "description": "From the #1 New York Times bestselling author of The Hotel Nantucket After tragedy strikes, Hollis Shaw gathers four friends from different stages in her life to spend an unforgettable weekend on Nantucket.Hollis Shaw’s life seems picture-perfect. She’s the creator of the popular food blog Hungry with Hollis and is married to Matthew, a dreamy heart surgeon. But after she and Matthew get into a heated argument one snowy morning, he leaves for the airport and is killed in a car accident. The cracks in Hollis’s perfect life—her strained marriage and her complicated relationship with her daughter, Caroline—grow deeper.So when Hollis hears about something called a “Five-Star Weekend”—one woman organizes a trip for her best friend from each phase of her life: her teenage years, her twenties, her thirties, and midlife—she decides to host her own Five-Star Weekend on Nantucket. But the weekend doesn’t turn out to be a joyful Hallmark movie.The husband of Hollis’s childhood friend Tatum arranges for Hollis’s first love, Jack Finigan, to spend time with them, stirring up old feelings. Meanwhile, Tatum is forced to play nice with abrasive and elitist Dru-Ann, Hollis’s best friend from UNC Chapel Hill. Dru-Ann’s career as a prominent Chicago sports agent is on the line after her comments about a client’s mental health issues are misconstrued online. Brooke, Hollis’s friend from their thirties, has just discovered that her husband is having an inappropriate relationship with a woman at work. Again! And then there’s Gigi, a stranger to everyone (including Hollis) who reached out to Hollis through her blog. Gigi embodies an unusual grace and, as it hap- pens, has many secrets.The Five-Star Weekend is a surprising and captivating story about friendship, love, and self-discovery set on Nantucket. It will be a weekend like no other.",
    "series_details": null,
    "book_details": {
      "pages_format": "384 pages, Hardcover",
      "publication_info": "First published June 13, 2023"
    },
    "genres": [
      "Fiction",
      "Romance",
      "Audiobook",
      "Chick Lit",
      "Contemporary",
      "Adult",
      "Adult Fiction"
    ],
    "avg_rating": 4.07,
    "num_ratings": 173857.0,
    "num_reviews": 11857.0
  },
  {
    "title": "Someone Else's Shoes",
    "author": [
      "Jojo Moyes"
    ],
    "description": "A story of mix-ups, mess-ups and making the most of second chances, this is the new novel from #1 New York Times bestselling author Jojo Moyes, author of Me Before You and The Giver of Stars.Who are you when you are forced to walk in someone else’s shoes?Nisha Cantor lives the globetrotting life of the seriously wealthy, until her husband announces a divorce and cuts her off. Nisha is determined to hang onto her glamorous life. But in the meantime, she must scramble to cope--she doesn’t even have the shoes she was, until a moment ago, standing in.That’s because Sam Kemp – in the bleakest point of her life – has accidentally taken Nisha’s gym bag. But Sam hardly has time to worry about a lost gym bag--she’s struggling to keep herself and her family afloat. When she tries on Nisha’s six-inch high Christian Louboutin red crocodile shoes, the resulting jolt of confidence that makes her realize something must change—and that thing is herself.Full of Jojo Moyes’ signature humor, brilliant storytelling, and warmth, Someone Else’s Shoes is a story about how just one little thing can suddenly change everything.",
    "series_details": null,
    "book_details": {
      "pages_format": "438 pages, Hardcover",
      "publication_info": "First published February 2, 2023"
    },
    "genres": [
      "Fiction",
      "Audiobook",
      "Romance",
      "Chick Lit",
      "Contemporary",
      "Adult",
      "Adult Fiction"
    ],
    "avg_rating": 3.96,
    "num_ratings": 180736.0,
    "num_reviews": 15389.0
  },
  {
    "title": "The Invisible Hour",
    "author": [
      "Alice Hoffman"
    ],
    "description": "The latest New York Times bestseller from beloved author Alice Hoffman celebrates the enduring magic of books and is a “wonderful story of love and growth” (Stephen King).One June day when Mia Jacob can no longer see a way to survive, the power of words saves her. The Scarlet Letter was written almost two hundred years earlier, but it seems to tell the story of Mia’s mother, Ivy, and their life inside the Community—an oppressive cult in western Massachusetts where contact with the outside world is forbidden. But how could this be? How could Nathaniel Hawthorne have so perfectly captured the pain and loss that Mia carries inside her?Through a journey of heartbreak, love, and time, Mia must abandon the rules she was raised with at the Community. As she does, she realizes that reading can transport you to other worlds or bring them to you, and that readers and writers affect one another in mysterious ways. She learns that time is more fluid than she can imagine, and that love is stronger than any chains that bind you.As a girl Mia fell in love with a book. Now as a young woman she falls in love with a brilliant writer as she makes her way back in time. But what if Nathaniel Hawthorne never wrote The Scarlet Letter ? And what if Mia Jacob never found it on the day she planned to die?From “the reigning queen of magical realism” (Kristin Hannah, New York Times bestselling author), this is the story of one woman’s dream. For a little while it came true.",
    "series_details": null,
    "book_details": {
      "pages_format": "272 pages, Hardcover",
      "publication_info": "First published August 15, 2023"
    },
    "genres": [
      "Fiction",
      "Historical Fiction",
      "Magical Realism",
      "Fantasy",
      "Time Travel",
      "Audiobook",
      "Books About Books"
    ],
    "avg_rating": 3.62,
    "num_ratings": 30241.0,
    "num_reviews": 4544.0
  },
  {
    "title": "Maame",
    "author": [
      "Jessica George"
    ],
    "description": "Shortlisted for the TikTok Book Awards in the Book of the Year, 2023 and the Goodreads Debut and Fiction Book of the Year, 2023.It’s fair to say that Maddie’s life in London is far from rewarding. With a mother who spends most of her time in Ghana (yet still somehow manages to be overbearing), Maddie is the primary caretaker for her father, who suffers from advanced stage Parkinson’s. At work, her boss is a nightmare and Maddie is tired of always being the only Black person in every meeting.When her mum returns from her latest trip to Ghana, Maddie leaps at the chance to get out of the family home and finally start living. A self-acknowledged late bloomer, she’s ready to experience some important “firsts”: She finds a flat share, says yes to after-work drinks, pushes for more recognition in her career, and throws herself into the bewildering world of internet dating. But it's not long before tragedy strikes, forcing Maddie to face the true nature of her unconventional family, and the perils—and rewards—of putting her life on the line.Smart, funny, and deeply affecting, Jessica George's Maame deals with the themes of our time with humor and poignancy: from familial duty and racism, to female pleasure, the complexity of love, and the life-saving power of friendship. Most important, it explores what it feels like to be torn between two homes and cultures―and it celebrates finally being able to find where you belong.",
    "series_details": null,
    "book_details": {
      "pages_format": "320 pages, Hardcover",
      "publication_info": "First published January 31, 2023"
    },
    "genres": [
      "Fiction",
      "Contemporary",
      "Audiobook",
      "Literary Fiction",
      "Coming Of Age",
      "Adult",
      "Family"
    ],
    "avg_rating": 4.07,
    "num_ratings": 88760.0,
    "num_reviews": 11488.0
  },
  {
    "title": "Illuminae",
    "author": [
      "Amie Kaufman",
      "Jay Kristoff"
    ],
    "description": "This morning, Kady thought breaking up with Ezra was the hardest thing she’d have to do. This afternoon, her planet was invaded.The year is 2575, and two rival mega-corporations are at war over a planet that’s little more than a speck at the edge of the universe. Now with enemy fire raining down on them, Kady and Ezra — who are barely even talking to each other—are forced to evacuate with a hostile warship in hot pursuit.But their problems are just getting started. A plague has broken out and is mutating with terrifying results; the fleet’s AI may actually be their enemy; and nobody in charge will say what’s really going on. As Kady hacks into a web of data to find the truth, it’s clear the only person who can help her is the ex-boyfriend she swore she’d never speak to again.Told through a fascinating dossier of hacked documents — including emails, maps, files, IMs, medical reports, interviews, and more — Illuminae is the first book in a heart-stopping trilogy about lives interrupted, the price of truth, and the courage of everyday heroes.",
    "series_details": "Book 1 in the The Illuminae Files series",
    "book_details": {
      "pages_format": "608 pages, Hardcover",
      "publication_info": "First published October 20, 2015"
    },
    "genres": [
      "Science Fiction",
      "Young Adult",
      "Romance",
      "Fantasy",
      "Fiction",
      "Dystopia",
      "Audiobook"
    ],
    "avg_rating": 4.24,
    "num_ratings": 152583.0,
    "num_reviews": 30112.0
  }
]